week7/W7D4/setter_g/app/controllers/goals_controller.rb

SELECT  "goals".* FROM "goals" WHERE "goals"."user_id" IS NULL LIMIT $1  [["LIMIT", 1]]
---
    def index
        @my_goals = Goal.find_by(user_id: current_user.id)

SELECT  "goals".* FROM "goals" WHERE "goals"."user_id" IS NULL LIMIT $1  [["LIMIT", 1]]
---
    def show
        @goal = Goal.find_by( user_id:current_user.id)